Functional-Programming/HOF/HOF.tex
% Created 2022-12-04 Sun 20:51
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.85in]{geometry}
\date{}
\title{Higher Order Function Exam Solutions}
\hypersetup{
 pdfauthor={Silent},
 pdftitle={Higher Order Function Exam Solutions},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{2021 Q1}
\label{sec:org76d275d}
\subsection{Part (a)}
\label{sec:org089a581}
\begin{verbatim}
hof :: (a -> b -> c) -> [a] -> [b] -> [c]
hof op (x:xs) (y:ys) = (x `op` y) : hof op xs ys
hof op _ _ = []
\end{verbatim}
\subsection{Part (b)}
\label{sec:orgef09777}
\begin{verbatim}
f1 = hof (+)
f2 = hof (++)
f3 = hof (*)
f4 = hof (\x _ -> (x+42))
f5 = hof (\x y -> (y-x*x))
\end{verbatim}
\subsection{Part (c)}
\label{sec:orgf085006}
\begin{itemize}
\item zipWith
\item Checking the type signatures can be blatant
\item Manually working through the functions can be blatant
\end{itemize}
\begin{verbatim}
hof :: (a -> b -> c) -> [a] -> [b] -> c
hof (+) [1,2,3] [4,5,6]
hof (+) (1 + 4) : hof [2,3] [5,6]
hof (+) (1 + 4) : (2 + 5) : hof [3,6]
hof (+) (1 + 4) : (2 + 5) : (3 + 6) : hof []
hof (+) (1 + 4) : (2 + 5) : (3 + 6) : []

zipWith :: (a -> b -> a) -> [a] -> [b] -> c
zipWith (+) [1,2,3] [4,5,6]
zipWith (+) (1 + 4) : hof [2,3] [5,6]
zipWith (+) (1 + 4) : (2 + 5) : hof [3,6]
zipWith (+) (1 + 4) : (2 + 5) : (3 + 6) : hof []
zipWith (+) (1 + 4) : (2 + 5) : (3 + 6) : []
\end{verbatim}
\newpage
\section{2021 Q1}
\label{sec:org1296ebc}
\subsection{Part (a)}
\label{sec:org3068e91}
\begin{verbatim}
hof :: (a -> b -> a) -> a -> [b] -> a
hof op x [] = x
hof op x (y:ys) = hof op (x `op` y) ys
\end{verbatim}
\subsection{Part (b)}
\label{sec:org5dd6bab}
\begin{verbatim}
f1 = hof (*)
f2 = hof (||)
f3 = hof (\a x -> 2*a+x)
f4 = hof (\xs ys -> ys ++ xs)
f5 = hof (-)
\end{verbatim}
\subsection{Part (c)}
\label{sec:orgd7125b3}
\begin{itemize}
\item foldl
\item Checking the type signatures can be blatant
\item Manually working through the functions can be blatant
\end{itemize}
\begin{verbatim}
hof :: (a -> b -> a) -> a -> [b] -> a
hof (+) 1 [1,2,3]
hof (+) (1 + 1) [2,3]
hof (+) ((1 + 1) + 2) [3]
hof (+) (((1 + 1) + 2)+ 3) []
hof (+) (((1 + 1) + 2)+ 3) = (((1 + 1) + 2) + 3) = 7

foldl :: (a -> b -> a) -> a -> [b] -> a
foldl (+) 1 [1,2,3]
foldl (+) (1 + 1) [2,3]
foldl (+) ((1 + 1) + 2) [3]
foldl (+) (((1 + 1) + 2)+ 3) []
foldl (+) (((1 + 1) + 2)+ 3) = 7
\end{verbatim}
\newpage
\section{2019 Q3}
\label{sec:org966ec55}
\subsection{Part (a) (i)}
\label{sec:orgad0aad7}
\begin{verbatim}
hof :: (a -> b -> b) -> b -> [a] -> b
hof op e [] = e
hof op e (x:xs) = x `op` hof op e xs
\end{verbatim}
\subsection{Part (b) (ii)}
\label{sec:orgf98eec4}
\begin{verbatim}
f1 = hof 42 (*)
f2 = hof 0 (\x y -> 99 * y)
f3 = hof 0 (+)
f4 = hof [] (++)
f5 = hof 0 (\x xs -> (x-42) + xs)
\end{verbatim}
\section{2017 Q2}
\label{sec:org8e4f95c}
\begin{itemize}
\item Same Answer as in 2019 Q3
\end{itemize}
\section{2016 Q2}
\label{sec:orgf140ca6}
\subsection{Part (a)}
\label{sec:org2d3f31d}
\begin{verbatim}
hof :: (a -> b -> b) -> b -> [a] -> b
hof op e [] = e
hof op e (x:xs) = x `op` hof op e xs
\end{verbatim}
\subsection{Part (b)}
\label{sec:org3aac84a}
\begin{verbatim}
f1 = hof (*) 1
f2 = hof (\_ xs -> 1 + xs) 0
f3 = hof (+) 0
f4 = hof (++) []
f5 = hof (\x xs -> (x*x) + xs) 0
\end{verbatim}
\newpage
\section{2015 Q2}
\label{sec:org20d4326}
\subsection{Part (a)}
\label{sec:orga6fc2ba}
\begin{verbatim}
hof :: (a -> b -> c) -> [a] -> [b] -> [c]
hof op [] _ = []
hof op _ [] = []
hof op (x:xs) (y:ys) = (x `op` y) : hof op xs ys
\end{verbatim}
\subsection{Part (b)}
\label{sec:orgbad515b}
\begin{verbatim}
hof :: (a -> b -> c) -> [a] -> [b] -> [c]
\end{verbatim}
\subsection{Part (c)}
\label{sec:orge31a38c}
\begin{verbatim}
f1 = hof (*)
f2 = hof (+)
f3 = hof (\x y -> (x y))
f4 = hof (\x y -> (x,y))
f5 = hof (\x y -> (const x y))
\end{verbatim}
\subsection{Part (d)}
\label{sec:orgaf1f33e}
\begin{itemize}
\item zipWith
\end{itemize}
\section{2014 Q2}
\label{sec:orgb1c2e31}
\subsection{Part (a)}
\label{sec:orga30a54c}
\begin{verbatim}
hof :: (a -> b -> a) -> a -> [b] -> a
hof op x [] = x
hof op x (y:ys) = hof op (x `op` y) ys -- Don't forget to give op pleasesee
\end{verbatim}
\subsection{Part (b)}
\label{sec:org03295c6}
\begin{verbatim}
f1 = hof (*)
f2 = hof (\x y -> x + 1)
f3 = hof (+)
f4 = hof (\x y -> x ++ y)
f5 = hof (\x y -> x + y * y)
\end{verbatim}
\subsection{Part (c)}
\label{sec:org941ebb7}
\begin{itemize}
\item foldl
\end{itemize}
\newpage
\section{2016 Q2}
\label{sec:org76bda11}
\begin{itemize}
\item Same Answer as in 2019 Q2 for parts (a) and (b)
\end{itemize}
\subsection{Part (c)}
\label{sec:org4d13d0a}
\begin{itemize}
\item foldr
\item Checking the type signatures can be blatant
\item Manually working through the functions can be blatant
\end{itemize}
\begin{verbatim}
hof :: (a -> b -> b) -> b -> [a] -> b
hof (+) 1 [1,2,3,4]
hof (+) 1 * [2,3,4]
hof (+) (1 * 2) [3,4]
hof (+) (1 * (2 * 3)) [4]
hof (+) (1 * (2 * (3 * 4))) []
hof (+) (1 * (2 * (3 * 4))) = 24

foldr :: (a -> b -> b) -> b -> [a] -> b
foldr (+) 1 [1,2,3,4]
foldr (+) 1 * [2,3,4]
foldr (+) (1 * 2) [3,4]
foldr (+) (1 * (2 * 3)) [4]
foldr (+) (1 * (2 * (3 * 4))) []
foldr (+) (1 * (2 * (3 * 4))) = 24
\end{verbatim}
\end{document}